Revit 2027 API
Material.MaterialCategory Property
 The name of the material category, e.g. 'Wood'
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string MaterialCategory { get; set; }
Public Property MaterialCategory As String
	Get
	Set
public:
property String^ MaterialCategory {
	String^ get ();
	void set (String^ value);
}
member MaterialCategory : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
Material Class
Autodesk.Revit.DB Namespace